backend/app/controllers/admin/dashboard_controller.rb

  def index
    @stats = {
      organizations: Organization.count,
      rockets: Rocket.count,
      satellites: Satellite.count,
      launches: Launch.count,
      news: News.count,
      space_probes: SpaceProbe.count,
      launch_sites: LaunchSite.count,
      space_events: SpaceEvent.count,
      space_missions: SpaceMission.count,
      astronauts: Astronaut.count
---
SELECT COUNT(*) FROM "astronauts"
SELECT COUNT(*) FROM "launch_sites"
SELECT COUNT(*) FROM "launches"
SELECT COUNT(*) FROM "news"