backend/app/controllers/api/v1/dashboard_controller.rb

SELECT COUNT(*) FROM "astronauts"
SELECT COUNT(*) FROM "launches" WHERE (launch_date > '2025-08-10 00:00:21.462378')
SELECT COUNT(*) FROM "news" WHERE (published_at >= '2025-08-03 00:00:21.474964')
SELECT COUNT(*) FROM "organizations"
---
      def index
        render json: {
          stats: {
            total_organizations: Organization.count,
            total_rockets: Rocket.count,
            total_satellites: Satellite.count,
            total_launches: Launch.count,
            total_space_missions: SpaceMission.count,
            total_astronauts: Astronaut.count,
            upcoming_launches: Launch.upcoming.count,
            recent_news: News.recent.count

SELECT id, name, payload_capacity, mass FROM "rockets" WHERE (payload_capacity > 0) ORDER BY "rockets"."payload_capacity" ASC
SELECT id, name, mass, purpose FROM "satellites" WHERE (mass > 0) ORDER BY "satellites"."mass" ASC
---
      def mission_cost_estimator
        # Get cost data for mission estimation
        rockets = Rocket.select('id, name, payload_capacity, mass')
                       .where('payload_capacity > 0')
                       .order(:payload_capacity)

        satellites = Satellite.select('id, name, mass, purpose')
                            .where('mass > 0')
                            .order(:mass)

SELECT COUNT(*) FROM "astronauts" INNER JOIN "astronaut_missions" ON "astronauts"."id" = "astronaut_missions"."astronaut_id" WHERE "astronaut_missions"."space_mission_id" = 21
---
      def human_space_missions
        # Get human space mission statistics
        missions = SpaceMission.joins(:astronauts)
                              .group('space_missions.id, space_missions.name, space_missions.status, space_missions.start_date, space_missions.end_date')
                              .select('space_missions.id, space_missions.name, space_missions.status, space_missions.start_date, space_missions.end_date,
                                      COUNT(astronauts.id) as astronaut_count')
                              .order('space_missions.start_date DESC')
                              .limit(20)

SELECT COUNT(*) AS "count_all", "astronauts"."nationality" AS "astronauts_nationality" FROM "astronauts" GROUP BY "astronauts"."nationality"
SELECT COUNT(*) AS "count_all", "astronauts"."status" AS "astronauts_status" FROM "astronauts" GROUP BY "astronauts"."status"
---
      def astronaut_statistics
        # Get astronaut statistics by nationality and status
        nationality_stats = Astronaut.group(:nationality)
                                   .count
                                   .sort_by { |_, count| -count }
                                   .first(10)

        status_stats = Astronaut.group(:status)
                               .count

SELECT "space_missions".* FROM "space_missions" ORDER BY "space_missions"."start_date" ASC LIMIT 50
---
      def space_mission_timeline
        # Get space mission timeline data
        missions = SpaceMission.includes(:organizations, :astronauts)
                              .order(:start_date)
                              .limit(50)

        data = missions.map do |mission|

SELECT COUNT(*) FROM "launches" INNER JOIN "rockets" ON "launches"."rocket_id" = "rockets"."id" WHERE "rockets"."organization_id" = 25
---
      def organization_performance
        # Get comprehensive organization performance metrics
        organizations = Organization.joins(rockets: :launches)
                                  .group('organizations.id, organizations.name')
                                  .select('organizations.id, organizations.name,
                                          COUNT(DISTINCT rockets.id) as rocket_count,
                                          COUNT(DISTINCT launches.id) as launch_count,
                                          COUNT(CASE WHEN launches.status = \'success\' THEN 1 END) as successful_launches,
                                          COUNT(CASE WHEN launches.status = \'failed\' THEN 1 END) as failed_launches,
                                          AVG(rockets.payload_capacity) as avg_payload_capacity')
                                  .having('COUNT(launches.id) > 0')
                                  .order('launch_count DESC')