backend/app/controllers/api/v1/launches_controller.rb

SELECT "rockets".* FROM "rockets" WHERE "rockets"."id" IN (3, 1, 2)
SELECT "satellites".* FROM "satellites" WHERE "satellites"."id" IN (1, 3)
---
      def index
        @launches = Launch.includes(:rocket, :satellites).all

        # Apply filters
        @launches = @launches.by_status(params[:status]) if params[:status].present?
        @launches = @launches.by_rocket(params[:rocket_id]) if params[:rocket_id].present?
        @launches = @launches.by_site(params[:launch_site]) if params[:launch_site].present?
        @launches = @launches.upcoming if params[:type] == 'upcoming'
        @launches = @launches.past if params[:type] == 'past'
        @launches = @launches.recent if params[:recent] == 'true'

        # Apply search
        if params[:search].present?
          @launches = @launches.where("launches.name ILIKE ? OR launches.mission_objective ILIKE ?",
                                    "%#{params[:search]}%", "%#{params[:search]}%")
        end

        # Date range filter
        if params[:launch_date_from].present?
          @launches = @launches.where('launch_date >= ?', DateTime.parse(params[:launch_date_from]))
        end
        if params[:launch_date_to].present?
          @launches = @launches.where('launch_date <= ?', DateTime.parse(params[:launch_date_to]))
        end

        # Sorting
        sort_by = params[:sort_by] || 'launch_date'
        sort_order = params[:sort_order] || 'desc'
        @launches = @launches.order(sort_by => sort_order)

SELECT "launches".* FROM "launches" WHERE "launches"."id" = 9 LIMIT 1
SELECT "rockets".* FROM "rockets" WHERE "rockets"."id" = 14
SELECT "satellites".* FROM "satellites" WHERE "satellites"."id" = 14
---
      def show
        @launch = Launch.includes(:rocket, :satellites).find(params[:id])