backend/app/controllers/api/v1/launches_controller.rb

      def index
        @launches = Launch.includes(rocket: :organization, satellites: :organization)
                         .order(launch_date: :desc)
                         .page(params[:page])
                         .per(params[:per_page] || 12)
---
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" IN (27, 25, 26, 28)

      def show
        @launch = Launch.includes(rocket: :organization, satellites: :organization).find(params[:id])
---
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = 27