backend/app/controllers/api/v1/launches_controller.rb

SELECT "launches".* FROM "launches" ORDER BY "launches"."launch_date" DESC LIMIT 12 OFFSET 0
SELECT "rockets".* FROM "rockets" WHERE "rockets"."id" IN (19, 20, 22, 23, 21)
SELECT "satellites".* FROM "satellites" WHERE "satellites"."id" IN (19, 22, 20, 23)
---
      def index
        @launches = Launch.includes(:rocket, :satellites)
                         .order(launch_date: :desc)
                         .page(params[:page])
                         .per(params[:per_page] || 12)

SELECT "launches".* FROM "launches" WHERE "launches"."id" = 19 LIMIT 1
SELECT "rockets".* FROM "rockets" WHERE "rockets"."id" = 20
SELECT "satellites".* FROM "satellites" WHERE "satellites"."id" = 22
---
      def show
        @launch = Launch.includes(:rocket, :satellites).find(params[:id])