backend/app/controllers/api/v1/news_controller.rb

      def index
        @news = News.order(published_at: :desc)
                   .page(params[:page])
                   .per(params[:per_page] || 12)
---
SELECT "news".* FROM "news" ORDER BY "news"."published_at" DESC LIMIT 12 OFFSET 0