backend/app/controllers/api/v1/news_controller.rb

      def index
        @news = News.all

        # Apply filters
        @news = @news.by_category(params[:category]) if params[:category].present?
        @news = @news.by_source(params[:source]) if params[:source].present?
        @news = @news.featured if params[:featured] == 'true'
        @news = @news.recent if params[:recent] == 'true'

        # Apply search
        if params[:search].present?
          @news = @news.where("title ILIKE ? OR summary ILIKE ?",
                             "%#{params[:search]}%", "%#{params[:search]}%")
        end

        # Date range filter
        if params[:published_from].present?
          @news = @news.where('published_at >= ?', DateTime.parse(params[:published_from]))
        end
        if params[:published_to].present?
          @news = @news.where('published_at <= ?', DateTime.parse(params[:published_to]))
        end

        # Sorting
        sort_by = params[:sort_by] || 'published_at'
        sort_order = params[:sort_order] || 'desc'
        @news = @news.order(sort_by => sort_order)

        # Pagination
        @news = @news.page(@page).per(@per_page)
---
SELECT "news".* FROM "news" ORDER BY "news"."published_at" DESC LIMIT 20 OFFSET 0