backend/app/controllers/api/v1/organizations_controller.rb

SELECT "organizations".* FROM "organizations" ORDER BY "organizations"."created_at" DESC LIMIT 12 OFFSET 0
SELECT "rockets".* FROM "rockets" WHERE "rockets"."organization_id" IN (16, 15, 14, 13, 12, 11, 10, 9)
SELECT "satellites".* FROM "satellites" WHERE "satellites"."organization_id" IN (16, 15, 14, 13, 12, 11, 10, 9)
---
      def index
        @organizations = Organization.includes(:rockets, :satellites)
                                   .order(created_at: :desc)
                                   .page(params[:page])
                                   .per(params[:per_page] || 12)

SELECT "launches".* FROM "launches" WHERE "launches"."rocket_id" IN (21, 22)
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = 26 LIMIT 1
---
      def show
        @organization = Organization.includes(rockets: :launches, satellites: :launches).find(params[:id])