backend/app/controllers/api/v1/organizations_controller.rb

SELECT "organizations".* FROM "organizations" LIMIT 20 OFFSET 0
---
      def index
        @organizations = Organization.all

        # Apply filters
        @organizations = @organizations.by_country(params[:country]) if params[:country].present?
        @organizations = @organizations.by_type(params[:type]) if params[:type].present?
        @organizations = @organizations.active if params[:status] == 'active'

        # Apply search
        if params[:search].present?
          @organizations = @organizations.where("name ILIKE ? OR description ILIKE ?",
                                               "%#{params[:search]}%", "%#{params[:search]}%")
        end

        # Pagination
        @organizations = @organizations.page(@page).per(@per_page)