backend/app/controllers/api/v1/organizations_controller.rb

      def show
        @organization = Organization.includes(:rockets, :satellites, :launch_sites, :astronauts).find(params[:id])
---
SELECT "rockets".* FROM "rockets" WHERE "rockets"."organization_id" = 1
SELECT "satellites".* FROM "satellites" WHERE "satellites"."organization_id" = 1