backend/app/controllers/api/v1/rockets_controller.rb

SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" IN (1, 2)
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" IN (16, 12, 10, 9, 11)
SELECT "rockets".* FROM "rockets" ORDER BY "rockets"."name" ASC LIMIT 20 OFFSET 0
---
      def index
        @rockets = Rocket.includes(:organization).all

        # Apply filters
        @rockets = @rockets.by_organization(params[:organization_id]) if params[:organization_id].present?
        @rockets = @rockets.by_status(params[:status]) if params[:status].present?
        @rockets = @rockets.active if params[:active] == 'true'

        # Apply search
        if params[:search].present?
          @rockets = @rockets.where("rockets.name ILIKE ? OR rockets.description ILIKE ?",
                                   "%#{params[:search]}%", "%#{params[:search]}%")
        end

        # Sorting
        sort_by = params[:sort_by] || 'name'
        sort_order = params[:sort_order] || 'asc'
        @rockets = @rockets.order(sort_by => sort_order)

        # Pagination
        @rockets = @rockets.page(@page).per(@per_page)

SELECT "launches".* FROM "launches" WHERE "launches"."rocket_id" = 14
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = 15
SELECT "rockets".* FROM "rockets" WHERE "rockets"."id" = 14 LIMIT 1
---
      def show
        @rocket = Rocket.includes(:organization, :launches).find(params[:id])