backend/app/controllers/api/v1/rockets_controller.rb

      def show
        @rocket = Rocket.includes(:organization, :launches).find(params[:id])
---
SELECT "launches".* FROM "launches" WHERE "launches"."rocket_id" = 11
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = 12
SELECT "rockets".* FROM "rockets" WHERE "rockets"."id" = 11 LIMIT 1