backend/app/controllers/api/v1/satellites_controller.rb

      def index
        @satellites = Satellite.includes(:organization).all

        # Apply filters
        @satellites = @satellites.by_organization(params[:organization_id]) if params[:organization_id].present?
        @satellites = @satellites.by_orbit_type(params[:orbit_type]) if params[:orbit_type].present?
        @satellites = @satellites.by_status(params[:status]) if params[:status].present?
        @satellites = @satellites.active if params[:active] == 'true'
        @satellites = @satellites.recent if params[:recent] == 'true'

        # Apply search
        if params[:search].present?
          @satellites = @satellites.where("satellites.name ILIKE ? OR satellites.purpose ILIKE ? OR satellites.description ILIKE ?",
                                        "%#{params[:search]}%", "%#{params[:search]}%", "%#{params[:search]}%")
        end

        # Date range filter
        if params[:launch_date_from].present?
          @satellites = @satellites.where('launch_date >= ?', Date.parse(params[:launch_date_from]))
        end
        if params[:launch_date_to].present?
          @satellites = @satellites.where('launch_date <= ?', Date.parse(params[:launch_date_to]))
        end

        # Sorting
        sort_by = params[:sort_by] || 'name'
        sort_order = params[:sort_order] || 'asc'
        @satellites = @satellites.order(sort_by => sort_order)

        # Pagination
        @satellites = @satellites.page(@page).per(@per_page)
---
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" IN (2, 1)
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" IN (28, 25, 26, 27)
SELECT "satellites".* FROM "satellites" ORDER BY "satellites"."name" ASC LIMIT 20 OFFSET 0

      def show
        @satellite = Satellite.includes(:organization, :launches).find(params[:id])
---
SELECT "launches".* FROM "launches" WHERE "launches"."id" = 6
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = 13
SELECT "satellites".* FROM "satellites" WHERE "satellites"."id" = 13 LIMIT 1