backend/app/controllers/api/v1/satellites_controller.rb

      def index
        @satellites = Satellite.includes(:organization)
                              .order(created_at: :desc)
                              .page(params[:page])
                              .per(params[:per_page] || 12)
---
SELECT "satellites".* FROM "satellites" ORDER BY "satellites"."created_at" DESC LIMIT 12 OFFSET 0

      def show
        @satellite = Satellite.includes(:organization, :launches).find(params[:id])
---
SELECT "launches".* FROM "launches" WHERE "launches"."id" = 23
SELECT "organizations".* FROM "organizations" WHERE "organizations"."id" = 26
SELECT "satellites".* FROM "satellites" WHERE "satellites"."id" = 20 LIMIT 1